# EnergyAnalysisOpening Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisOpening Class
Members See Also
---
Analytical opening.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class EnergyAnalysisOpening : Element
```

Visual Basic
---
```text
Public Class EnergyAnalysisOpening _
	Inherits Element
```

Visual C++
---
```text
public ref class EnergyAnalysisOpening : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Analysis..::..EnergyAnalysisOpening
# See Also
EnergyAnalysisOpening Members
Autodesk.Revit.DB.Analysis Namespace